{
    "projects": [
      {
        "title": "Development and Control of a Rocket Hopper Demonstrator",
        "github": "https://github.com/Fortranibal/Rocket-Hopper-DDPG",
        "description": "Developed TD3-based reinforcement learning algorithm for precise altitude control, achieving 141.35 reward score through 10+ physical test launches. Created comprehensive digital twin simulation validated against ESA's EcoSimPro tool."
      },
      {
        "title": "WSPR (WESP's Predictive Rocketry Tool)",
        "description": "Led 14-person team developing 6-DOF trajectory simulator, completing 1,200+ development hours with <5% error vs. real flight data. Created Monte Carlo safety analysis system and automated report generation for Range Safety Officers."
      },
      {
        "title": "Robust Pose Estimation for Asteroids (Master Thesis)",
        "description": "Developed computer vision pipeline for autonomous asteroid navigation at DLR, comparing six classic and learned feature extraction approaches. Implemented complete 3D reconstruction system using Structure from Motion and point cloud mapping for uncertain lighting conditions."
      },
      {
        "title": "Synthetic Asteroid Dataset Generation",
        "description": "Enhanced DLR's OAISYS simulator to generate 30,000+ synthetic asteroid images with RGB-D data and 6D poses. Co-authored paper for IEEE Aerospace Conference 2025, generating landing on synthetic asteroid model sequences, and integrating YOLOv7 object detection."
      },
      {
        "title": "Advanced Bi-Propellant Rocket Propulsion System",
        "description": "Designed 100-bar chamber pressure LOX/LCH4 propulsion system with 93% efficient dual-turbine arrangement for 5,000kg LEO payload capacity. Implemented regenerative cooling and MATLAB-optimized bell nozzle design."
      },
      {
        "title": "Phobos Explorer Propulsion System",
        "description": "Engineered bi-propellant architecture achieving 3.25 km/s ΔV budget for 2-year Phobos mission. Designed complete P&ID system with hydrazine/MON-3 propellants and multiple mission-critical burns."
      },
      {
        "title": "Comet Explorers Mission",
        "description": "Led trajectory design for MBC 324P/La Sagra comet mining mission using SpaceX Starship platform. Developed custom numerical porkchop plot algorithm and analyzed RASSOR mining technology implementation."
      },
      {
        "title": "Spacecraft Operations for Lunar Mining",
        "description": "Engineered 4-day ballistic lunar transfer trajectory achieving 0.05-degree pointing accuracy. Implemented dual-band communication system and sophisticated power system with deployable solar arrays."
      },
      {
        "title": "CFD Flow Field Prediction using CNNs",
        "description": "Implemented autoregressive CNN architecture for fluid dynamics prediction with Bayesian uncertainty quantification. Combined classical ML and deep learning approaches for significant performance optimization."
      },
      {
        "title": "Neural Network Adversarial Attacks",
        "description": "Investigated CNN vulnerabilities using FGSM attacks, achieving 98.1% and 99.1% baseline accuracy for LeNet and ResNet-18. Developed comprehensive defense strategies and visualization system for adversarial perturbations."
      },
      {
        "title": "Financial Market Simulator",
        "description": "Built C++ application simulating S&P500 market dynamics using Geometric Brownian Motion. Implemented real-time price adjustments and multiple investment timeline simulations with customizable risk profiles and strategies."
      },
      {
        "title": "Ocean Plastic Detection Satellite",
        "description": "Led power systems design for Earth observation satellite operating in -30°C to +60°C range. Achieved 20m ground sampling distance in Sun-synchronous orbit with comprehensive thermal control system."
      },
      {
        "title": "Interactive Web Chat Application",
        "description": "Developed real-time chat platform with cross-browser compatibility and <100ms response time. Implemented user authentication and dynamic content loading using AJAX and JSON APIs."
      }
    ]
  }
  